Repository: OleksandrSatanivskyi/OnlineAuction
Catalog: FortuneWheel.Presentation/Resources/Views/Home/About.*.resx
Languages: de_de, fr_fr, uk_ua

source: About
de_de: Um
fr_fr: À propos
uk_ua: Інформація

# ASP.NET
source: ASP.NET MVC was chosen because it has a number of advantages for project development in this context. It separates logic, data, and views using the MVC (Model-View-Controller) design pattern, which provides a simple structure, makes code management easier, and allows product development as quickly as possible, making it ideal for small solutions. ASP.NET MVC is based on the .NET platform, which is open to development by the developer community and allows you to create your own components and extend its functionality through various extensions and third-party libraries.
de_de: ASP.NET MVC wurde gewählt, weil es in diesem Zusammenhang eine Reihe von Vorteilen für die Projektentwicklung bietet. Es trennt Logik, Daten und Ansichten mithilfe des MVC-Entwurfsmusters (Model-View-Controller), was eine einfache Struktur bietet, die Codeverwaltung erleichtert und eine möglichst schnelle Produktentwicklung ermöglicht, was es ideal für kleine Lösungen macht. ASP.NET MVC basiert auf der .NET-Plattform, die für die Entwicklung durch die Entwickler-Community offen ist und es Ihnen ermöglicht, Ihre eigenen Komponenten zu erstellen und ihre Funktionalität durch verschiedene Erweiterungen und Bibliotheken von Drittanbietern zu erweitern.
fr_fr: ASP.NET MVC a été choisi car il présente de nombreux avantages pour le développement de projets dans ce contexte. Il sépare la logique, les données et les vues à l'aide du modèle de conception MVC (Model-View-Controller), qui fournit une structure simple, facilite la gestion du code et permet le développement de produits le plus rapidement possible, ce qui le rend idéal pour les petites solutions. ASP.NET MVC est basé sur la plate-forme .NET, ouverte au développement par la communauté des développeurs et vous permet de créer vos propres composants et d'étendre ses fonctionnalités via diverses extensions et bibliothèques tierces.
uk_ua: ASP.NET MVC був обраний тому, що він має низку переваг для розробки проекту в даному контексті. Він розділяє логіку, дані та представлення за допомогою шаблону проектування MVC (Model-View-Controller), що містить просту структуру, полегшує управління кодом, та дозволяє розробляти продукт максимально швидко, тому він ідеально підходить для невеликих рішень. ASP.NET MVC базується на платформі .NET, яка є відкритою для розвитку спільнотою розробників та дає можливість створювати власні компоненти та розширювати його функціональність через різноманітні розширення та сторонні бібліотеки.

# Entity Framework
source: Entity Framework allows developers to work with the database through an object-oriented approach, instead of writing complex SQL queries. This makes working with the database more understandable and convenient. It automatically creates and updates the database schema based on .NET data models, allowing developers to focus on business logic rather than the details of creating or modifying database tables.
de_de: Entity Framework ermöglicht Entwicklern, mit der Datenbank über einen objektorientierten Ansatz zu arbeiten, anstatt komplexe SQL-Abfragen zu schreiben. Dies macht die Arbeit mit der Datenbank verständlicher und bequemer. Es erstellt und aktualisiert das Datenbankschema automatisch basierend auf .NET-Datenmodellen, sodass sich Entwickler auf die Geschäftslogik konzentrieren können und nicht auf die Details der Erstellung oder Änderung von Datenbanktabellen.
fr_fr: Entity Framework permet aux développeurs de travailler avec la base de données via une approche orientée objet, au lieu d'écrire des requêtes SQL complexes. Cela rend le travail avec la base de données plus compréhensible et plus pratique. Il crée et met à jour automatiquement le schéma de base de données basé sur des modèles de données .NET, permettant aux développeurs de se concentrer sur la logique métier plutôt que sur les détails de la création ou de la modification des tables de base de données.
uk_ua: Entity Framework дозволяє розробникам працювати з базою даних через об'єктно-орієнтований підхід, замість написання складних SQL-запитів. Це робить роботу з базою даних більш зрозумілою та зручною. Він автоматично створює та оновлює схему бази даних на основі моделей даних .NET, що дозволяє розробникам зосередитися на бізнес-логіці, а не на деталях створення або модифікації таблиць бази даних.

# Feature 1
source: The site provides reliable access to the platform through authorization and authentication procedures, guaranteeing the confidentiality and security of personal information.
de_de: Die Site bietet durch Autorisierungs- und Authentifizierungsverfahren zuverlässigen Zugriff auf die Plattform und gewährleistet so die Vertraulichkeit und Sicherheit persönlicher Daten.
fr_fr: Le site offre un accès fiable à la plateforme grâce à des procédures d'autorisation et d'authentification, garantissant la confidentialité et la sécurité des informations personnelles.
uk_ua: Сайт забезпечує надійний доступ до платформи шляхом процедур авторизації та аутентифікації, гарантуючи конфіденційність та безпеку особистої інформації.

# Feature 2
source: Users have the ability not only to create and delete auctions, but also to save and modify them in the future for repeated use, which makes the process of conducting auctions more efficient and convenient.
de_de: Benutzer haben nicht nur die Möglichkeit, Auktionen zu erstellen und zu löschen, sondern sie auch zur späteren Verwendung zu speichern und zu ändern, was die Durchführung von Auktionen effizienter und bequemer macht.
fr_fr: Les utilisateurs ont la possibilité non seulement de créer et de supprimer des enchères, mais également de les enregistrer et de les modifier ultérieurement pour une utilisation répétée, ce qui rend le processus de conduite des enchères plus efficace et plus pratique.
uk_ua: Користувачі мають можливість не лише створювати та видаляти аукціони, але й зберігати їх та змінювати в майбутньому для повторного використання, що робить процес проведення аукціонів більш ефективним і зручним.

# Feature 3
source: There are two types of auctions: classic and point auctions. In a classic auction, all participants have the same number of points, while in a point auction, the distribution of points may differ from participant to participant. Depending on the number of points in the point auction, the size of the wheel of fortune segments will differ relative to each other. If the classic mode is selected, the segments with more points will be larger in size, if the elimination mode is selected, the segments with more points will be smaller in size to increase the chance of winning.
de_de: Es gibt zwei Arten von Auktionen: klassische und Punkteauktionen. Bei einer klassischen Auktion haben alle Teilnehmer die gleiche Anzahl an Punkten, während bei einer Punkteauktion die Punkteverteilung von Teilnehmer zu Teilnehmer unterschiedlich sein kann. Abhängig von der Anzahl der Punkte bei der Punkteauktion unterscheidet sich die Größe der Glücksradsegmente im Verhältnis zueinander. Wenn der klassische Modus ausgewählt ist, sind die Segmente mit mehr Punkten größer, wenn der Eliminationsmodus ausgewählt ist, sind die Segmente mit mehr Punkten kleiner, um die Gewinnchance zu erhöhen.
fr_fr: Il existe deux types d’enchères : les enchères classiques et les enchères par points. Dans une enchère classique, tous les participants disposent du même nombre de points, tandis que dans une enchère par points, la répartition des points peut différer d'un participant à l'autre. En fonction du nombre de points dans l'enchère de points, la taille des segments de la roue de la fortune différera les uns par rapport aux autres. Si le mode classique est sélectionné, les segments avec plus de points seront plus grands, si le mode élimination est sélectionné, les segments avec plus de points seront plus petits pour augmenter les chances de gagner.
uk_ua: Існує два типи аукціонів: класичний та поінтовий. У класичному аукціоні всі учасники мають однакову кількість очок, в той час як у поінтовому розподіл очок може відрізнятися від учасника до учасника. Залежно від кількості очок у поінтовому аукціоні розмір сегментів колеса фортуни буде відрізнятись один відносно одного. Якщо вибраний режим «класика», то сегменти з більшою кількістю очок будуть більшими по розміру, якщо вибраний режим «вибування», то сегменти з більшою кількістю очок будуть меншими по розміру для збільшення шансу на виграш.

# Feature 4
source: Auctions are conducted in the form of a wheel of fortune, which adds an element of randomness and intrigue to the process.
de_de: Auktionen werden in Form eines Glücksrads durchgeführt, was dem Prozess ein Element von Zufall und Intrige hinzufügt.
fr_fr: Les enchères se déroulent sous la forme d’une roue de la fortune, ce qui ajoute un élément de hasard et d’intrigue au processus.
uk_ua: Проведення аукціонів відбувається у формі колеса фортуни, що додає елемент випадковості та інтриги до процесу.

# Feature 5
source: During the auction, users have the opportunity to adjust the participants' parameters. For a classic auction, this includes setting the bidder's color and name, while for a point auction, this also includes the number of points for each bidder.
de_de: Während der Auktion haben Nutzer die Möglichkeit, Parameter für die Teilnehmer anzupassen. Bei einer klassischen Auktion sind das beispielsweise die Farbe und der Name des Bieters, bei einer Punkteauktion auch die Anzahl der Punkte für jeden Bieter.
fr_fr: Pendant l'enchère, les utilisateurs ont la possibilité d'ajuster les paramètres des participants. Pour une vente aux enchères classique, cela inclut la définition de la couleur et du nom de l'enchérisseur, tandis que pour une vente aux enchères par points, cela inclut également le nombre de points pour chaque enchérisseur.
uk_ua: Під час проведення аукціону, користувачі мають можливість налаштовувати параметри учасників. Для класичного аукціону це включає встановлення кольору та назви учасника, в той час як для поінтового аукціону, це також включає кількість очок кожного учасника.

# Feature 6
source: One of the key advantages of the service is the ability to flexibly customize the wheel, including the number of revolutions per spin, the duration of the spin and the color of the segments.
de_de: Einer der Hauptvorteile des Dienstes ist die Möglichkeit, das Rad flexibel anzupassen, einschließlich der Anzahl der Umdrehungen pro Drehung, der Dauer der Drehung und der Farbe der Segmente.
fr_fr: L'un des principaux avantages du service est la possibilité de personnaliser la roue de manière flexible, notamment le nombre de tours par rotation, la durée de la rotation et la couleur des segments.
uk_ua: Однією з ключових переваг сервісу є можливість гнучкого налаштування колеса, включаючи кількість обертів за одну прокрутку, тривалість прокрутки та колір сегментів.

# Feature 7
source: The platform offers two auction modes: classic and elimination mode. In classic mode, the winner is the contestant who lands on the wheel after one spin, while in elimination mode, contestants are eliminated in succession until there is only one winner left.
de_de: Die Plattform bietet zwei Auktionsmodi: den klassischen und den Eliminationsmodus. Im klassischen Modus gewinnt der Teilnehmer, der nach einer Drehung auf dem Rad landet, während im Eliminationsmodus die Teilnehmer nacheinander eliminiert werden, bis nur noch ein Gewinner übrig ist.
fr_fr: La plateforme propose deux modes d'enchères : le mode classique et le mode élimination. En mode classique, le gagnant est le concurrent qui atterrit sur la roue après un tour, tandis qu'en mode élimination, les concurrents sont éliminés successivement jusqu'à ce qu'il ne reste plus qu'un seul gagnant.
uk_ua: Платформа пропонує два режими проведення аукціонів: класичний та режим вибування. У класичному режимі переможцем стає учасник, що випав на колесі після однієї прокрутки, тоді як у режимі вибування учасники вибувають послідовно до тих пір, доки не залишиться один переможець.

# Frontend
source: HTML, CSS, Javascript are standards in front-end development, they provide wide opportunities for customizing the appearance of the interface, are common and have the ability to expand functionality through third-party libraries. CSS is a quality tool that allows you to create specialized animations of various levels, which will be useful for the development of the wheel of fortune.
de_de: HTML, CSS und Javascript sind Standards in der Frontend-Entwicklung. Sie bieten umfassende Möglichkeiten zur Anpassung des Erscheinungsbilds der Benutzeroberfläche, sind weit verbreitet und bieten die Möglichkeit, die Funktionalität durch Bibliotheken von Drittanbietern zu erweitern. CSS ist ein hochwertiges Tool, mit dem Sie spezielle Animationen auf verschiedenen Ebenen erstellen können, die für die Entwicklung des Glücksrads nützlich sind.
fr_fr: HTML, CSS, Javascript sont des standards dans le développement front-end, ils offrent de larges possibilités de personnalisation de l'apparence de l'interface, sont courants et ont la capacité d'étendre les fonctionnalités via des bibliothèques tierces. CSS est un outil de qualité qui permet de créer des animations spécialisées de différents niveaux, qui seront utiles au développement de la roue de la fortune.
uk_ua: HTML, CSS, Javascript є стандартами у фронтенд розробці, вони надають широкі можливості для налаштування вигляду інтерфейсу, є поширеними і мають можливість розширювати функціонал через сторонні бібліотеки. CSS є якісним інструментом, що дозволяє створювати спеціалізовані анімації різного рівня, що буде корисно для розробки колеса фортуни.

# General description
source: The platform was created with the order to provide a convenient tool for conducting online auctions in the form of a wheel of fortune with flexible parameters. Main characteristics:
de_de: Die Plattform wurde mit dem Ziel geschaffen, ein praktisches Tool für die Durchführung von Online-Auktionen in Form eines Glücksrads mit flexiblen Parametern bereitzustellen. Hauptmerkmale:
fr_fr: La plateforme a été créée dans le but de fournir un outil pratique pour mener des enchères en ligne sous la forme d'une roue de la fortune avec des paramètres flexibles. Caractéristiques principales:
uk_ua: Платформа створена з метою надати зручний інструмент проведення аукціонів онлайн у вигляді колеса фортуни із гнучкими параметрами. Основні характеристики:

source: Online auction platform
de_de: Online-Auktionsplattform
fr_fr: Plateforme d'enchères en ligne
uk_ua: Онлайн аукціон

# SQL Server
source: SQL Server provides a wide range of possibilities for working with data, which makes it a powerful solution for various web applications and systems, especially in the context of the .NET platform.
de_de: SQL Server bietet vielfältige Möglichkeiten zur Arbeit mit Daten und stellt damit insbesondere im Kontext der .NET-Plattform eine leistungsstarke Lösung für diverse Webanwendungen und -systeme dar.
fr_fr: SQL Server offre un large éventail de possibilités pour travailler avec des données, ce qui en fait une solution puissante pour diverses applications et systèmes Web, notamment dans le contexte de la plate-forme .NET.
uk_ua: SQL Server надає широкий спектр можливостей роботи з даними що робить його потужним рішенням для різноманітних веб-додатків та систем особливо в контексті платформи .NET.

# Technical side
source: The technical side of the platform and the rationale for the choice of technologies
de_de: Die technische Seite der Plattform und die Gründe für die Wahl der Technologien
fr_fr: L'aspect technique de la plateforme et la justification du choix des technologies
uk_ua: Технічна сторона платформи та обгрунтування вибору технологій

# Technical side description
source: The following technologies were chosen for software development: ASP.NET MVC, SQL Server, Entity Framework, Javascript, HTML, CSS, bootstrap.
de_de: Für die Softwareentwicklung wurden folgende Technologien ausgewählt: ASP.NET MVC, SQL Server, Entity Framework, Javascript, HTML, CSS, Bootstrap.
fr_fr: Les technologies suivantes ont été choisies pour le développement logiciel : ASP.NET MVC, SQL Server, Entity Framework, Javascript, HTML, CSS, bootstrap.
uk_ua: Для розробки програмного забезпечення були обрані наступні технології: ASP.NET MVC, SQL Server, Entity Framework, Javascript, HTML, CSS, bootstrap.
