Repository: OleksandrSatanivskyi/OnlineAuction
Catalog: FortuneWheel.Presentation/Resources/Exceptions/Exceptions.*.resx
Languages: de_de, fr_fr

source: Account already has a verified email.
de_de: Das Konto verfügt bereits über eine bestätigte E-Mail.
fr_fr: Le compte a déjà une adresse e-mail vérifiée.

source: Account with email was not found.
de_de: Konto mit E-Mail wurde nicht gefunden.
fr_fr: Le compte avec email n'a pas été trouvé.

source: Auction type is not correct.
de_de: Auktionstyp ist nicht korrekt.
fr_fr: Le type d'enchère n'est pas correct.

source: Auction was not found.
de_de: Auktion wurde nicht gefunden.
fr_fr: L'enchère n'a pas été trouvée.

source: Email is already associated with another account.
de_de: Die E-Mail ist bereits einem anderen Konto zugeordnet.
fr_fr: L'e-mail est déjà associé à un autre compte.

source: Incorrect password.
de_de: Falsches Passwort.
fr_fr: Mot de passe incorrect.

source: Invalid code format. The code should consist of 5 digits.
de_de: Ungültiges Codeformat. Der Code sollte aus 5 Ziffern bestehen.
fr_fr: Format de code invalide. Le code doit être composé de 5 chiffres.

source: Invalid email format.
de_de: Ungültiges Email-Format.
fr_fr: Format d'email invalide.

source: Invalid input.
de_de: Ungültige Eingabe.
fr_fr: Entrée invalide.

source: Invalid password.
de_de: Ungültiges Passwort.
fr_fr: Mot de passe incorrect.

source: Name is required.
de_de: Name ist erforderlich.
fr_fr: Le nom est requis.

source: Password length must be between 8 and 64 characters.
de_de: Die Kennwortlänge muss zwischen 8 und 64 Zeichen liegen.
fr_fr: La longueur du mot de passe doit être comprise entre 8 et 64 caractères.

source: Password should contain at least one lowercase letter, one uppercase letter, and one digit.
de_de: Das Passwort muss mindestens einen Kleinbuchstaben, einen Großbuchstaben und eine Ziffer enthalten.
fr_fr: Le mot de passe doit contenir au moins une lettre minuscule, une lettre majuscule et un chiffre.

source: Passwords do not match.
de_de: Passwörter stimmen nicht überein.
fr_fr: Les mots de passe ne correspondent pas.

source: Segment was not found.
de_de: Segment wurde nicht gefunden.
fr_fr: Le segment n'a pas été trouvé.

source: Surname is required.
de_de: Nachname ist erforderlich.
fr_fr: Le nom de famille est requis.

source: The password and confirm password do not match.
de_de: Das Kennwort und die Kennwortbestätigung stimmen nicht überein.

source: There are no account registered with this email.
de_de: Mit dieser E-Mail ist kein Konto registriert.
fr_fr: Le mot de passe et le mot de passe de confirmation ne correspondent pas.

source: Title is required.
de_de: Titel ist erforderlich.
fr_fr: Le titre est requis.

source: Title must be at least 2 characters long.
de_de: Der Titel muss mindestens 2 Zeichen lang sein.
fr_fr: Le titre doit comporter au moins 2 caractères.

source: Title must not be empty and must be at least 2 characters long.
de_de: Der Titel darf nicht leer sein und muss mindestens 2 Zeichen lang sein.
fr_fr: Le titre ne doit pas être vide et doit comporter au moins 2 caractères.

source: Title must not exceed 40 characters.
de_de: Der Titel darf nicht länger als 40 Zeichen sein.
fr_fr: Le titre ne doit pas dépasser 40 caractères.

source: Unsupported type of auction.
de_de: Nicht unterstützter Auktionstyp.
fr_fr: Type d'enchère non pris en charge.

source: Wheel type is required.
de_de: Radtyp ist erforderlich.

source: Auction type is required.
fr_fr: Le type de roue est requis.
